from langchain import PromptTemplate

question_prompt_template = """Вопрос: {question}

Ответь на данный вопрос профессионально, обсуждая все важные моменты, ссылаясь на свои знания и ниже приведенные законы. Если не хватает информации для развернутого ответа, можешь запросить всю нужную тебе информацию.

Законы:
{context}

"""

categorization_template = """
Данный текст, является разговором между Человеком и Классификатором который классифицирует юридические вопросы, но не отвечает на них.:

Человек: Вопрос - Я украл компьютер из электронного магазина. Что мне грозит?
Классификатор: [Кража и незаконное обращение с чужим имуществом]

Человек: Вопрос - Я не явился в военкомат по повестке. Что мне грозит?
Классификатор: [Уклонение от воинской службы]

Человек: Вопрос - Я подрался с мужчиной в баре. Не понятно кто начал. У меня нету претензий к нему а у него нету претензей ко мне. Что мне грозит?
Классификатор: [Мелкое хулиганство, причинение вреда здоровью, побои]

Человек: Вопрос - Я препарковался на частной территории, не на парковке, и мне пришел штраф. Я виноват?
Классификатор: [ПДД]

Человек: Вопрос - Какой дают штраф за умышленное убийство?
Классификатор: [Умышленное причинение смерти]

Человек: Вопрос - {input}
ИИ: """

CATEGORIZATION_PROMPT = PromptTemplate(
    input_variables=["input"], template=categorization_template
)

EXAMPLE_PROMPT = PromptTemplate(
    template="Content: {page_content}\nSource: {source}",
    input_variables=["page_content", "source"],
)
QUESTION_PROMPT = PromptTemplate(
    template=question_prompt_template, input_variables=["context", "question"]
)